In [1]:
import pandas as pd
import numpy as np
url="C:/Users/Win 10/Documents/FB.csv"
data= pd.read_csv(url)

### HANDLE THE MISSING VALUE

In [13]:
# 1. Drop the entire row or entire column containing the missing values
# 2. Numeric data: replace the missing value by the average of remaining
# 3. Categorical data: replace by the mode of that column

In [11]:
# function .dropna(): used to drop the row (axis=0) and column (axis=1) of NA values
data.dropna(subset=["Close"],axis=0,inplace=True)
data.head(5)

,Date,Open,High,Low,Close,Adj Close,Volume
0,2019-12-02,202.130005,202.179993,198.050003,199.699997,199.699997,11503400
1,2019-12-03,197.600006,198.929993,195.080002,198.820007,198.820007,11595300
2,2019-12-04,200.000000,200.029999,198.050003,198.710007,198.710007,8456300
3,2019-12-05,199.860001,201.289993,198.210007,199.360001,199.360001,9740400
4,2019-12-06,200.500000,201.570007,200.059998,201.050003,201.050003,12270600

In [12]:
# function .replace(): used to replace the NA values with certain new value
mean= data["Volume"].mean()
data["Volume"]=data["Volume"].replace(np.nan,mean)
data.head(5)

,Date,Open,High,Low,Close,Adj Close,Volume
0,2019-12-02,202.130005,202.179993,198.050003,199.699997,199.699997,11503400
1,2019-12-03,197.600006,198.929993,195.080002,198.820007,198.820007,11595300
2,2019-12-04,200.000000,200.029999,198.050003,198.710007,198.710007,8456300
3,2019-12-05,199.860001,201.289993,198.210007,199.360001,199.360001,9740400
4,2019-12-06,200.500000,201.570007,200.059998,201.050003,201.050003,12270600